IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_DRAM0_SLV_RAM.xml
<module name="PRU_ICSSG1_DRAM0_SLV_RAM" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="DRAM0__SLV__RAM_RAM_REG" acronym="DRAM0__SLV__RAM_RAM_REG" offset="0x0" width="32" description="The RAM memory words provide memory mapped random access data storage.">
		<bitfield id="BYTE3" width="8" begin="31" end="24" resetval="0x0" description="This is the MS byte" range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="BYTE2" width="8" begin="23" end="16" resetval="0x0" description="This is the UM byte" range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="BYTE1" width="8" begin="15" end="8" resetval="0x0" description="This is the LM byte" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="BYTE0" width="8" begin="7" end="0" resetval="0x0" description="This is the LS byte" range="7 - 0" rwaccess="R/W"/>
	</register>
</module>